libonvif/Remote/dpws_discovery.Probe.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
 xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
 xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
 xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
 xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
 xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
 <SOAP-ENV:Header>
  <wsa:MessageID></wsa:MessageID>
  <wsa:ReplyTo>
   <Address></Address>
   <ReferenceProperties>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </ReferenceProperties>
   <ReferenceParameters>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </ReferenceParameters>
   <PortType></PortType>
   <ServiceName PortName=""></ServiceName>
   <!-- extensibility element(s) -->

   <!-- extensibility element(s) -->

  </wsa:ReplyTo>
  <wsa:To></wsa:To>
  <wsa:Action></wsa:Action>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <wsd:Probe>
    <wsd:Types></wsd:Types>
    <wsd:Scopes MatchBy=""></wsd:Scopes>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsd:Probe>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
